README.org
# This file is used to generate README.md through Org-mode C-c C-e m m

This repository contains examples and exercises solutions from [[https://www.gopl.io/]["The Go Programming Language" book]], written by Brian W. Kernighan and Alan A. A. Donovan. Some challenging exercises have their own directories instead of a single file.

- **Naming of files: exercise1-1.go = Exercise 1.1**

* Solution checklists
** Chapter 1 [5/12]
- [X] Exercise 1.1
- [X] Exercise 1.2
- [ ] Exercise 1.3
- [ ] Exercise 1.4
- [ ] Exercise 1.5
- [ ] Exercise 1.6
- [X] Exercise 1.7
- [X] Exercise 1.8
- [ ] Exercise 1.9
- [ ] Exercise 1.10
- [ ] Exercise 1.11
- [X] Exercise 1.12
** Chapter 2 [1/5]
- [X] Exercise 2.1
- [ ] Exercise 2.2
- [ ] Exercise 2.3
- [ ] Exercise 2.4
- [ ] Exercise 2.5
** Chapter 3 [1/13]
- [ ] Exercise 3.1
- [ ] Exercise 3.2
- [ ] Exercise 3.3
- [ ] Exercise 3.4
- [ ] Exercise 3.5
- [ ] Exercise 3.6
- [ ] Exercise 3.7
- [ ] Exercise 3.8
- [ ] Exercise 3.9
- [X] Exercise 3.10
- [ ] Exercise 3.11
- [ ] Exercise 3.12
- [ ] Exercise 3.13
