README.md

# Table of Contents

1.  [Solution checklists](#orgd02a5f5)
    1.  [Chapter 1 <code>[5/12]</code>](#orge12a2dc)
    2.  [Chapter 2 <code>[1/5]</code>](#org3cda3c8)
    3.  [Chapter 3 <code>[1/13]</code>](#org4246a1a)

This repository contains examples and exercises solutions from [&ldquo;The Go Programming Language&rdquo; book](https://www.gopl.io/), written by Brian W. Kernighan and Alan A. A. Donovan. Some challenging exercises have their own directories instead of a single file.

-   ****Naming of files: exercise1-1.go = Exercise 1.1****


<a id="orgd02a5f5"></a>

# Solution checklists


<a id="orge12a2dc"></a>

## Chapter 1 <code>[5/12]</code>

-   [X] Exercise 1.1
-   [X] Exercise 1.2
-   [ ] Exercise 1.3
-   [ ] Exercise 1.4
-   [ ] Exercise 1.5
-   [ ] Exercise 1.6
-   [X] Exercise 1.7
-   [X] Exercise 1.8
-   [ ] Exercise 1.9
-   [ ] Exercise 1.10
-   [ ] Exercise 1.11
-   [X] Exercise 1.12


<a id="org3cda3c8"></a>

## Chapter 2 <code>[1/5]</code>

-   [X] Exercise 2.1
-   [ ] Exercise 2.2
-   [ ] Exercise 2.3
-   [ ] Exercise 2.4
-   [ ] Exercise 2.5


<a id="org4246a1a"></a>

## Chapter 3 <code>[1/13]</code>

-   [ ] Exercise 3.1
-   [ ] Exercise 3.2
-   [ ] Exercise 3.3
-   [ ] Exercise 3.4
-   [ ] Exercise 3.5
-   [ ] Exercise 3.6
-   [ ] Exercise 3.7
-   [ ] Exercise 3.8
-   [ ] Exercise 3.9
-   [X] Exercise 3.10
-   [ ] Exercise 3.11
-   [ ] Exercise 3.12
-   [ ] Exercise 3.13

